# PythonEndContext

## Description
Closes python context previously opened with PythonBeginContext.

```pascal
PROCEDURE PythonEndContext;
```

```python
def vs.PythonEndContext():
    return None
```

## Examples
[[VS:PythonExecute]].

## See Also
VS Functions:
PythonBeginContext

## Version
Availability: from Vectorworks 2014

## Category
* Utility